In [2]:
#importing libraries
from datasets import load_dataset
import pandas as pd
import matplotlib as plt

# loading data
dataset = load_dataset("lukebarousse/data_jobs")
df = dataset['train'].to_pandas()

# data cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [3]:
df.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [7]:
median_salary_year = df['salary_year_avg'].median()

In [8]:
median_salary_hour = df['salary_hour_avg'].median()

In [10]:
df_filled = df

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [12]:
df.loc[:10, 'salary_rate':'salary_hour_avg']

   salary_rate  salary_year_avg  salary_hour_avg
0         None         115000.0            45.98
1         None         115000.0            45.98
2         None         115000.0            45.98
3         None         115000.0            45.98
4         None         115000.0            45.98
5         None         115000.0            45.98
6         None         115000.0            45.98
7         None         115000.0            45.98
8         None         115000.0            45.98
9         None         115000.0            45.98
10        None         115000.0            45.98

In [14]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

In [15]:
df_unique = df_unique.drop_duplicates(subset= ['job_title','company_name'])

print('length of original df:     ', len(df_filled))
print('length of drop duplicates df:', len(df_unique))
print('rows dropped:      ', len(df_filled)-len(df_unique))

length of original df:      785741
length of drop duplicates df: 508042
rows dropped:       277699